Revit 2024 API
ParameterTypeId.AnalyticConstructionGbxmlTypeid Property
 "Construction Type Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticConstructionGbxmlTypeid { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticConstructionGbxmlTypeid As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticConstructionGbxmlTypeid {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace